# Introduction to Pandas

### What is pandas?
- Pandas stands for __Pan__el-__Da__ta.
- Pandas relies on some core data structures for its operations:
    - Series: data array with a named index.
    - DataFrame: a data "matrix" with labeled index and columns.

# Pandas Series
- A pandas series is very similar to a numpy array, except for the  addition of a named index. 
- We can use this named index to grab data from the array.

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']

mylist = [10,20,30]
arr = np.array([10,20,30])
d= {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(mylist)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(mylist, labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
salesQ1 = pd.Series(data=[250,450,200,150],index=['USA','China','India','Brazil'])

In [8]:
salesQ1

USA       250
China     450
India     200
Brazil    150
dtype: int64

In [9]:
salesQ2 = pd.Series(data=[260,500,200,100],index=['USA','China','India','Japan'])

In [10]:
salesQ2

USA      260
China    500
India    200
Japan    100
dtype: int64

In [11]:
salesQ2['USA']

260

In [12]:
salesQ2[0]

260

In [13]:
salesQ2[10]

IndexError: index 10 is out of bounds for axis 0 with size 4

In [14]:
salesQ1+salesQ2

Brazil      NaN
China     950.0
India     400.0
Japan       NaN
USA       510.0
dtype: float64

# Pandas DataFrame
- A DataFrame is simply multiple pandas series that share the same index. 
- You can think of a DataFrame as being similar to a spreadsheet, just a lot more powerful!

In [15]:
columns = ['W', 'X', 'Y', 'Z']

In [16]:
index = ['A', 'B', 'C', 'D', 'E']

In [17]:
from numpy.random import randint

In [18]:
np.random.seed(42)
data = randint(-100,100,(5,4))

In [19]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [20]:
df = pd.DataFrame(data, index, columns)

In [21]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [22]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int64

In [23]:
type(df['W'])

pandas.core.series.Series

=> It proves that the columns of Pandas DataFrame are all just pandas Series that happened to share the same index values (i.e. we have this structure of Series that we can join together by some common index to get a nice DataFrame).

### Select multiple columns
__: pass in a list of column names__, so then we get these double bracket notation:

In [24]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

### Create a new column based off some old columns 
(=> feature engineering) <br>
: simply reference a new column as if it already exists and then give the formulation for what we want to construct it based off the old columns.

In [25]:
df['new'] = df['W']+df['Y']

### Remove a column

In [26]:
df.drop('new', axis=1)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [27]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

(this is not an in-place dropping)

In [28]:
df = df.drop('new', axis=1)

In [30]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

### Select a row
- Method 1.

In [31]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

In [32]:
df.loc[['A','B']] #select multiple rows

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80

- Method 2.

In [33]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

### Remove a row
(I don't need to specify the axis, because by default access is equal to zero.)

In [34]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

### Select a subset of rows and column

In [35]:
df.loc['A', 'W']

2

In [36]:
df.loc[['A','C'], 'W']

A    2
C    2
Name: W, dtype: int64

In [37]:
df.loc[['A','C'], ['W','Y']]

   W   Y
A  2  -8
C  2 -26

### Select based off a certain condition

In [38]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [39]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [40]:
df[df > 0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [41]:
df['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [42]:
df[df['X'] > 0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

This itself is a DataFrame, I can perform oiperations such as grabbing a single column, get the very first integer location, etc.

In [43]:
df[df['X'] > 0]['W']

A     2
C     2
E    30
Name: W, dtype: int64

In [44]:
df[df['X'] > 0].iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int64

### Select based off multiple conditions

In [48]:
df[(df['W']  >0) & (df['Y'] > 1)]

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [47]:
df[(df['W']  >0) | (df['Y'] > 1)]

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

### Reset the index to integer values

In [49]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [50]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

### Reset the index: take a column that exists already

In [59]:
new_ind = ['CA', 'NY', 'WY', 'OR', 'CO']

In [60]:
df['States'] = new_ind

In [61]:
df

         W   X   Y   Z States
States
CA       2  79  -8 -86     CA
NY       6 -29  88 -80     NY
WY       2  21 -26 -13     WY
OR      16  -1   3  51     OR
CO      30  49 -48 -99     CO

In [62]:
df = df.set_index('States')

In [63]:
df

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

<font color="orange">\** "States" is not a column name, it is the name of the index!! It's denoted by the spacing. </font>

In [64]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

### Useful DataFrame summaries

In [65]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [70]:
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object

# Pandas Missing Data
- Realistically there are only 3 ways to deal with missing data: 
    - Leave it as missing
        - Depending on the type of data, this is a valid choice.
        - For example, if dealing with categorical data, we could simply treate a NaN as another category.
    - Remove the missing data
        - Large Percentage: too much missing to make a reasonable guess
        - Small Percentage: only removes a few data points from our dataset
    - Fill in the missing data
        - A non-trivial percentage is missing and the data point rows are important
        - Lot's of strategies available:
            - Mode, Mean, Median
            - Based off another feature column, conceive of a reasonable value

In [87]:
df = pd.DataFrame({'A':[1, 2, np.nan, 4],
                  'B': [5, np.nan, np.nan, 8],
                  'C': [10, 20, 30, 40]})

In [88]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

### Removing the missing data
- Parameter 1.

In [73]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [74]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [76]:
df.dropna(axis=1, thresh=3) #must have at least three non null values

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

### Fill in missing data

In [77]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

- Fill in with a value that you want

In [78]:
df.fillna(value='FILL VALUE')

            A           B   C
0         1.0         5.0  10
1         2.0  FILL VALUE  20
2  FILL VALUE  FILL VALUE  30
3         4.0         8.0  40

In [79]:
df.fillna(value=0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

- Fill in with the average value across the entire data

In [89]:
df.fillna(df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

### Fill in the missing data based off columns themselves
(instead of across the entire data)

- Fill in with a value that you want

In [81]:
df['A'] = df['A'].fillna(value=0)

In [82]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

- Fill in with the average value across df['B']

In [84]:
df['B'] = df['B'].fillna(value=df['B'].mean())

In [85]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

# Groupby Operations
- Often we want to explore how values are distributed or aggregated across groups.
- To do this, we use the groupby method, similar to GROUP By call in SQL. 
- This process is also often referred to as __Split-Apply-Combine__.
![Groupby Operations](img/groupby.png)
We choose a categorical column split based off those categories, apply the function per category, and then recombine it to get the final result. 
- The operation chosen with a groupby() call must be an __aggregation__ method.
- This means it can take multiple values and combine them to return a singular value.
    - Sum, Std, Mean, Count, Max, Min, etc.

In [90]:
df = pd.read_csv('/Users/admin/Desktop/tutorial/Complete-Tensorflow2-and-Keras-Deep-Learning-Bootcamp/TF_2_Notebooks_and_Data/DATA/Universities.csv')

In [91]:
df.head()

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada
3,"Private for-profit, less-than 2-year",Utah College of Massage Therapy-Vegas,2016,240,Nevada
4,"Public, 4-year or above",Western Nevada College,2016,960,Nevada

In [92]:
df.groupby('Year').sum()

      Completions
Year
2012        20333
2013        21046
2014        24730
2015        26279
2016        26224

In [93]:
df.groupby('Year').mean()

      Completions
Year
2012   535.078947
2013   526.150000
2014   588.809524
2015   597.250000
2016   609.860465

In [95]:
df.groupby('Year').sum().sort_index(ascending=False)

      Completions
Year
2016        26224
2015        26279
2014        24730
2013        21046
2012        20333

In [96]:
df.groupby(['Year', 'Sector']).sum()

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

In [97]:
df.groupby('Year').describe()

     Completions
           count        mean          std   min     25%    50%     75%     max
Year
2012        38.0  535.078947  1036.433239  13.0  114.25  229.5  420.50  5388.0
2013        40.0  526.150000  1040.474782   0.0   98.50  189.0  413.00  5278.0
2014        42.0  588.809524  1150.355857   0.0  104.50  203.5  371.75  5093.0
2015        44.0  597.250000  1183.371791   0.0   87.75  191.0  405.75  5335.0
2016        43.0  609.860465  1235.952796   0.0   90.00  208.0  414.00  5367.0

In [98]:
df.groupby('Year').describe().transpose()

Year                      2012         2013         2014         2015  \
Completions count    38.000000    40.000000    42.000000    44.000000
            mean    535.078947   526.150000   588.809524   597.250000
            std    1036.433239  1040.474782  1150.355857  1183.371791
            min      13.000000     0.000000     0.000000     0.000000
            25%     114.250000    98.500000   104.500000    87.750000
            50%     229.500000   189.000000   203.500000   191.000000
            75%     420.500000   413.000000   371.750000   405.750000
            max    5388.000000  5278.000000  5093.000000  5335.000000

Year                      2016
Completions count    43.000000
            mean    609.860465
            std    1235.952796
            min       0.000000
            25%      90.000000
            50%     208.000000
            75%     414.000000
            max    5367.000000

# Pandas Operations

In [99]:
df_one = pd.DataFrame({'k1':['A','A','B','B','C','C'],
                      'col1':[100,200,300,300,400,500],
                      'col2':['NY','CA','WA','WA','AK','NV']})

In [100]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

### Get information on unique values

In [101]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [102]:
df_one['col2'].nunique()

5

In [103]:
df_one['col2'].value_counts()

WA    2
NV    1
AK    1
NY    1
CA    1
Name: col2, dtype: int64

In [104]:
df_one.drop_duplicates() #it's going to drop the second duplicate

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

### Apply operator

In [105]:
df_one['New'] = df_one['col1']*10

In [106]:
df_one

  k1  col1 col2   New
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [107]:
def grab_first_letter(state):
    return state[0]

In [108]:
grab_first_letter('NY')

'N'

In [109]:
df_one['first letter'] = df_one['col2'].apply(grab_first_letter)

In [110]:
df_one

  k1  col1 col2   New first letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000            N

In [111]:
def complex_letter(state):
    
    if state[0] == "W":
        return "Washington"
    else:
        return "Error"

In [112]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

### Mapping, to quickly create new columns 
: the keys should be the existing values in the column.

In [113]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [114]:
my_map = {'A':1, 'B':2, 'C':3}

In [115]:
df_one['num'] = df_one['k1'].map(my_map)

In [116]:
df_one

  k1  col1 col2   New first letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000            N    3

### Locate the index positions of max and min values

In [117]:
df_one['col1'].max()

500

In [119]:
df_one['col1'].idxmax()

5

In [120]:
df_one['col1'].min()

100

In [121]:
df_one['col1'].idxmin()

0

### Get column and index names

In [122]:
df_one.columns

Index(['k1', 'col1', 'col2', 'New', 'first letter', 'num'], dtype='object')

In [124]:
df_one.columns = ['c1', 'c2', 'c3', 'c4', 'c5', 'c6']

In [125]:
df_one.sort_values('c3')

  c1   c2  c3    c4 c5  c6
4  C  400  AK  4000  A   3
1  A  200  CA  2000  C   1
5  C  500  NV  5000  N   3
0  A  100  NY  1000  N   1
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2

In [126]:
df_one.sort_values('c3', ascending=False)

  c1   c2  c3    c4 c5  c6
2  B  300  WA  3000  W   2
3  B  300  WA  3000  W   2
0  A  100  NY  1000  N   1
5  C  500  NV  5000  N   3
1  A  200  CA  2000  C   1
4  C  400  AK  4000  A   3

### Concatenate DataFrames

In [127]:
features = pd.DataFrame({'A':[100,200,300,400,500],
                        'B':[12,13,14,15,16]})

predictions = pd.DataFrame({'pred':[0,1,1,0,1]})

In [128]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  400  15
4  500  16

In [129]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [130]:
pd.concat([features,predictions])

       A     B  pred
0  100.0  12.0   NaN
1  200.0  13.0   NaN
2  300.0  14.0   NaN
3  400.0  15.0   NaN
4  500.0  16.0   NaN
0    NaN   NaN   0.0
1    NaN   NaN   1.0
2    NaN   NaN   1.0
3    NaN   NaN   0.0
4    NaN   NaN   1.0

In [131]:
pd.concat([features,predictions], axis=1)

     A   B  pred
0  100  12     0
1  200  13     1
2  300  14     1
3  400  15     0
4  500  16     1

### Create dummy variables

In [133]:
df_one['c1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: c1, dtype: object

In [134]:
pd.get_dummies(df_one['c1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

# Data Input and Output
### CSV

In [135]:
df = pd.read_csv('/Users/admin/Desktop/tutorial/Complete-Tensorflow2-and-Keras-Deep-Learning-Bootcamp/TF_2_Notebooks_and_Data/DATA/example.csv')

In [136]:
pwd

'/Users/admin/Desktop/tutorial/Complete-Tensorflow2-and-Keras-Deep-Learning-Bootcamp'

In [137]:
ls

NumPy Crash Course.ipynb   TF_2_Notebooks_and_Data/
Pandas Crash Course.ipynb  img/

In [138]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [140]:
df.to_csv('output.csv', index=True)

In [141]:
pd.read_csv('output.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [142]:
df.to_csv('output.csv', index=False)

In [143]:
pd.read_csv('output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### HTML
This only works if your firewall isnb't blocking pandas from accessing the internet!

tables = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

tables[0].head()